Tekla.Structures.ModelInternal.GeometryExporter.GeometryType
The type of the geometry
Those values must be synchronized with dotGeometryType_e values in TeklaStructures\libdotnet\interface\dotnet_common_types.h

Tekla.Structures.ModelInternal.GeometryExporter.GeometryType.POLYGON_SECTION
A flat polygon section.

Tekla.Structures.ModelInternal.GeometryExporter.GeometryType.CYLINDRICAL_SECTION
A curved section following a cylindrical geometry.

Tekla.Structures.ModelInternal.GeometryExporter.GeometryType.HELIX_SECTION
A helix section.